print("Текущие координаты (0,0)")
print("Введите направление движения(W-вверх, S-вниз, A-влево, D-вправо) и кол-во шагов, каждое в отдельной строке")
sl=("W","S","A","D")

while(True):
    s1=str(input())
    if s1 in sl:
        break
    else:
        print("Введено не правильное направление")
while(True):
    s2=int(input())
    if s2 >0:
        break
    else:
        print("Введено не правильное кол-во шагов")
if s1=="D":
    print("Новые координаты (",s2,",0)")
elif s1=="A":
    print("Новые координаты (",-s2,",0)")
elif s1=="W":
    print("Новые координаты (0,",s2,")")
elif s1=="S":
    print("Новые координаты (0,",-s2,")")